sdaiDeleteADB(Sdai_ADBId*)
\details
Deletes a specified Attribute Data Block (ADB) instance.
\param block [in] An ADB instance to be deleted.
\code
SdaiADB block = sdaiCreateEmptyADB();
...
sdaiDeleteADB(block);